app/controllers/posts_controller.rb

SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = 8
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')
---
  def index
    @authors = Author.all

    if !params[:author].blank?
      @posts = Post.where(author: params[:author])
    elsif !params[:date].blank?
      if params[:date] == "Today"
        @posts = Post.by_author(params[:author])
      else
        if params[:date] == "Today"
          @posts = Post.from_today
        else
          @posts = Post.old_news
        end
      end
    else
      @posts = Post.all